over write dr_failover
